public/essays/52-45-sanaa-2025/index.html
<!DOCTYPE html>
<html lang="en-us" data-theme="light">
<head>    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Sanaa 2025 - Against The Tide</title>
    
    
    <meta name="description" content="A series of fact-based civilian experience essays documenting U.S. military bombardments">
    <meta name="keywords" content="journalism, civilian, military, bombardment, essays, history">
    <meta name="author" content="TorchScribe">
    
    
    <meta property="og:type" content="article">
    <meta property="og:title" content="Sanaa 2025 - Against The Tide">
    <meta property="og:description" content="A series of fact-based civilian experience essays documenting U.S. military bombardments">
    <meta property="og:url" content="http://localhost:54718/essays/52-45-sanaa-2025/">
    
    
    <link href="https://fonts.googleapis.com/css2?family=Inter:wght@400;500;600;700&family=JetBrains+Mono:wght@400;700&display=swap" rel="stylesheet">
    <link rel="stylesheet" href="/css/style.css">
    
    
    <link rel="icon" type="image/svg+xml" href="/img/favicon.svg">
    <link rel="icon" type="image/png" href="/img/favicon.png">
    
    
</head>
<body>
    <div class="container">
        <header>
    <div class="logo">Against <span>The</span> Tide</div>
    <nav>
        
        
        <a href="/" >Home</a>
        
        <a href="/#essays" >Essays</a>
        
        <a href="/about/" >About</a>
        
        <button id="theme-toggle" aria-label="Toggle dark mode">
            <span class="theme-toggle-icon">◐</span>
        </button>
    </nav>
</header>

        <main>
            
<article class="essay-content markdown-content">
    <header class="essay-header">
        <h1>Sanaa 2025</h1>
        <div class="metadata">
            <p><strong>Location:</strong> Yemen</p>
            <p><strong>Year:</strong> 2025</p>
        </div>
    </header>
    
    <div class="essay-article">
        
<p>
On March 15, 2025, U.S. and allied forces launched a large-scale bombing campaign on Houthi targets in Sanaa, Yemen’s capital.</p>
<p>
Aisha al-Mutairi, a pediatrician, was tending patients when missiles struck a nearby arms depot. The shockwave collapsed part of the children’s hospital wing. She pulled two infants from rubble and worked overnight to stabilize the injured with dwindling supplies.</p>
<p>
Her account, circulated by Doctors Without Borders, illustrated the humanitarian cost of renewed U.S. involvement in Yemen.</p>
<p>
<strong><strong>Source:</strong></strong> <a href="https://www.doctorswithoutborders.org/latest/yemen-2025">MSF/Doctors Without Borders</a></p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Sources
</h2>
</div>

    </div>
    
    
    
    <div class="essay-navigation">
        <a href="/#essays" class="back-to-essays">← Back to Essays</a>
    </div>
</article>

        </main>

        <footer>
    <p>© 2025 Against The Tide · All rights reserved</p>
    <p>Curated by TorchScribe</p>
</footer>
    </div>

    <script>
    
    document.addEventListener('DOMContentLoaded', () => {
        const themeToggle = document.getElementById('theme-toggle');
        
        themeToggle.addEventListener('click', () => {
            const currentTheme = document.documentElement.getAttribute('data-theme');
            const newTheme = currentTheme === 'dark' ? 'light' : 'dark';
            
            setTheme(newTheme);
        });
    });
    
    
    document.addEventListener('keydown', (e) => {
        
        if (e.altKey && e.key === 's') {
            e.preventDefault();
            window.location.href = '/#essays';
        }
        
        
        if (e.altKey && e.key === 'Home') {
            e.preventDefault();
            window.location.href = '/';
        }
        
        
        if (e.altKey && e.key === 'e') {
            e.preventDefault();
            window.location.href = '/#essays';
        }
        
        
        if (e.altKey && e.key === 'a') {
            e.preventDefault();
            window.location.href = '/about/';
        }
    });
</script>
</body>
</html>